RIOT-OS/RIOT/cpu/cc2538/cc2538rf.c
    if (pkt->type != GNRC_NETTYPE_NETIF) {
        DEBUG("[cc2538rf]: First header was not generic netif header\n");
        gnrc_pktbuf_release(pkt);
        return -EBADMSG;
    }

    /* create 802.15.4 header */
    if (len == 0) {
        DEBUG("[cc2538rf] error: 802.15.4 header is empty\n");
        gnrc_pktbuf_release(pkt);
        return -ENOMSG;
    }


    /* check if packet (header + payload + FCS) fits into FIFO */
    snip = pkt->next;
    if ((gnrc_pkt_len(snip) + len + 2) > CC2538RF_MAX_PACKET_LEN) {
        printf("[cc2538rf] error: packet too large (%u byte) to be send\n",
               gnrc_pkt_len(snip) + len + 2);
        gnrc_pktbuf_release(pkt);
        DEBUG("cc2538rf: package overflow\n");
        return -EOVERFLOW;
    }
    DEBUG("cc2538rf: mac header len= %x, payload_len= %x\n", len, gnrc_pkt_len(snip));


    //TODO: prepare package for sending and send over fifo of cc2538rf
    DEBUG("cc2538rf: putting mac_header + payload_length+2 into RFDATA register\n");
    //RFCORE_SFR_RFDATA =  gnrc_pkt_len(snip) + len + 2;
    uint8_t package_size = gnrc_pkt_len(snip) + len + 2;
    cc2538rf_tx_load(&package_size, sizeof(package_size), 0);

    DEBUG("cc2538rf: putting stuff into the RFDATA register\n");
    cc2538rf_tx_load(mhr, len, 0);
    while(snip){
      cc2538rf_tx_load(snip->data, snip->size, 0);
      snip = snip->next;
    }

/*
    for(int i = 0; i<len; i++){
      RFCORE_SFR_RFDATA = mhr[i];
    }

    while(snip){
        for(int i = 0; i< snip->size; i++){
          RFCORE_SFR_RFDATA = ((uint8_t*)(snip->data))[i];
      }
      snip = snip->next;
    }
*/

    //read how much is in the TX FIFO
    DEBUG("cc2538rf: amount currently in the TX FIFO: %u\n", (uint8_t)RFCORE_XREG_TXFIFOCNT);

    //send transmit opcode to csp
    dev->state = NETOPT_STATE_TX;
    DEBUG("cc2538rf: trying to send over cc2538 RF DATA register\n");
    //set SET_RXENMASK_ON_TX to switch on RX after TX finished
    //RFCORE->XREG_FRMCTRL1 |= 0x01;
    cc2538rf_tx_exec();

    while(RFCORE_XREG_FSMSTAT1 & RFCORE_XREG_FSMSTAT1_TX_ACTIVE )
      DEBUG("cc2538rf: Still Sending\n");

    DEBUG("cc2538rf: sending complete\n");
    cc2538rf_flush_tx_fifo();
    dev->event_cb(NETDEV_EVENT_TX_COMPLETE, NULL);
    gnrc_pktbuf_release(pkt);
    dev->state = NETOPT_STATE_IDLE;

    return (int)len;
}


static int _add_event_cb(gnrc_netdev_t *dev, gnrc_netdev_event_cb_t cb)
{
  DEBUG("cc2538rf: adding event cb:\n");
    if (dev == NULL) {
        return -ENODEV;
    }
    if (dev->event_cb) {
        return -ENOBUFS;
    }

    dev->event_cb = cb;
    return 0;
}


static int _rem_event_cb(gnrc_netdev_t *dev, gnrc_netdev_event_cb_t cb)
{

  DEBUG("cc2538rf: removing event cb:\n");
  if (dev == NULL) {
      return -ENODEV;
  }
  if (dev->event_cb != cb) {
      return -ENOENT;
  }

  dev->event_cb = NULL;
  return 0;
}

//TODO: not implemented yet
static int _get(gnrc_netdev_t *device, netopt_t opt, void *val, size_t max_len)
{

  DEBUG("cc2538rf: getting options:\n");

    if(device == NULL) {
      return -ENODEV;
    }

    cc2538rf_t *dev = (cc2538rf_t *) device;

    switch (opt) {

      case NETOPT_ADDRESS:
      DEBUG("NETOPT_ADDRESS  ");
            if (max_len < sizeof(uint16_t)) {
                return -EOVERFLOW;
            }
            *((uint16_t *)val) = cc2538rf_get_addr_short(dev);
            return sizeof(uint16_t);
      break;

      case NETOPT_ADDRESS_LONG:
      DEBUG("NETOPT_ADDRESS_LONG  ");
            if (max_len < sizeof(uint64_t)) {
                return -EOVERFLOW;
            }
            *((uint64_t *)val) = cc2538rf_get_addr_long(dev);
            return sizeof(uint64_t);

      break;

      case NETOPT_ADDR_LEN:
      DEBUG("NETOPT_ADDR_LEN  ");
      break;

      case NETOPT_SRC_LEN:
      DEBUG("NETOPT_SRC_LEN  ");
            if (max_len < sizeof(uint16_t)) {
                return -EOVERFLOW;
            }
            if (dev->options & CC2538RF_OPT_SRC_ADDR_LONG) {
                *((uint16_t *)val) = 8;
            }
            else {
                *((uint16_t *)val) = 2;
            }
            return sizeof(uint16_t);

      case NETOPT_NID:
      DEBUG("NETOPT_NID  ");
            if (max_len < sizeof(uint16_t)) {
                return -EOVERFLOW;
            }
            *((uint16_t *)val) = dev->pan;
            return sizeof(uint16_t);

      case NETOPT_IPV6_IID:
      DEBUG("NETOPT_IPV6_IID  ");
            if (max_len < sizeof(eui64_t)) {
                return -EOVERFLOW;
            }
            if (dev->options & CC2538RF_OPT_SRC_ADDR_LONG) {
                uint64_t addr = cc2538rf_get_addr_long(dev);
                ieee802154_get_iid(val, (uint8_t *)&addr, 8);
            }
            else {
                uint16_t addr = cc2538rf_get_addr_short(dev);
                ieee802154_get_iid(val, (uint8_t *)&addr, 2);
            }
            return sizeof(eui64_t);
      break;

      case NETOPT_PROTO:
      DEBUG("NETOPT_PROTO  ");
            if (max_len < sizeof(gnrc_nettype_t)) {
                return -EOVERFLOW;
            }
            *((gnrc_nettype_t *)val) = dev->proto;
            return sizeof(gnrc_nettype_t);
      break;

      case NETOPT_CHANNEL:
      DEBUG("NETOPT_CHANNEL  ");
            if (max_len < sizeof(uint16_t)) {
                return -EOVERFLOW;
            }
            ((uint8_t *)val)[1] = 0;
            ((uint8_t *)val)[0] = cc2538rf_get_chan(dev);
            return sizeof(uint16_t);
      break;

      case NETOPT_TX_POWER:
      DEBUG("NETOPT_TX_POWER  ");
      break;

      case NETOPT_MAX_PACKET_SIZE:
      DEBUG("NETOPT_MAX_PACKET_SIZE  ");
            if (max_len < sizeof(int16_t)) {
                return -EOVERFLOW;
            }
            *((uint16_t *)val) = CC2538RF_MAX_PACKET_LEN - _MAX_MHR_OVERHEAD;
            return sizeof(uint16_t);
      break;

      case NETOPT_STATE:
      DEBUG("NETOPT_STATE  ");
      break;

      case NETOPT_PRELOADING:
      DEBUG("NETOPT_PRELOADING  ");
      break;

      case NETOPT_AUTOACK:
      DEBUG("NETOPT_AUTOACK  ");
      break;

