RIOT-OS/RIOT/cpu/cc2538/cc2538rf.c
      case NETOPT_RETRANS:
      DEBUG("NETOPT_RETRANS  ");
      break;

      case NETOPT_PROMISCUOUSMODE:
      DEBUG("NETOPT_PROMISCUOUSMODE  ");
      break;

      case NETOPT_RAWMODE:
      DEBUG("NETOPT_RAWMODE  ");
      break;

      case NETOPT_IS_CHANNEL_CLR:
      DEBUG("NETOPT_IS_CHANNEL_CLR  ");
      break;

      case NETOPT_RX_START_IRQ:
      DEBUG("NETOPT_RX_START_IRQ  ");
      break;

      case NETOPT_RX_END_IRQ:
      DEBUG("NETOPT_RX_END_IRQ  ");
      break;

      case NETOPT_TX_START_IRQ:
      DEBUG("NETOPT_TX_START_IRQ  ");
      break;

      case NETOPT_TX_END_IRQ:
      DEBUG("NETOPT_TX_END_IRQ  ");
      break;

      case NETOPT_CSMA:
      DEBUG("NETOPT_CSMA  ");
      break;

      case NETOPT_CSMA_RETRIES:
      DEBUG("NETOPT_CSMA_RETRIES  ");
      break;

      default:
      DEBUG("default");
      return -ENOTSUP;

    }

  return -1;
}

//TODO: not implemented yet
static int _set(gnrc_netdev_t *device, netopt_t opt, void *val, size_t len)
{
  cc2538rf_t* dev = (cc2538rf_t*) device;

  DEBUG("cc2538rf: setting options:\n");
  switch(opt){
    case NETOPT_ADDRESS_LONG:
      DEBUG("NETOPT_ADDRESS_LONG\n");
            if (len > sizeof(uint16_t)) {
                return -EOVERFLOW;
            }
            cc2538rf_set_addr_long(dev, *((uint64_t*)val));
            return sizeof(uint16_t);


    case NETOPT_ADDRESS:
      DEBUG("NETOPT_ADDRESS\n");
            if (len > sizeof(uint16_t)) {
                return -EOVERFLOW;
            }
            cc2538rf_set_addr_short(dev, *((uint16_t*)val));
            return sizeof(uint16_t);


    case NETOPT_NID:
      DEBUG("NETOPT_NID\n");
            if (len > sizeof(uint16_t)) {
                return -EOVERFLOW;
            }
            cc2538rf_set_pan(dev, *((uint16_t *)val));
            return sizeof(uint16_t);


    case NETOPT_SRC_LEN:
      DEBUG("NETOPT_SRC_LEN\n");
            if (len > sizeof(uint16_t)) {
                return -EOVERFLOW;
            }
            if (*((uint16_t *)val) == 2) {
                dev->options &= ~(CC2538RF_OPT_SRC_ADDR_LONG);
            }
            else if (*((uint16_t *)val) == 8) {
                dev->options |= CC2538RF_OPT_SRC_ADDR_LONG;
            }
            else {
                return -ENOTSUP;
            }
            return sizeof(uint16_t);

    default:
      DEBUG("DEFAULT\n");
      break;
  }

  if(device == NULL) {
    return -ENODEV;
  }


  return -1;
}

//TODO: not implemented yet
static void _isr_event(gnrc_netdev_t *device, uint32_t event_type)
{
  DEBUG("cc2538rf: isr event has been called\n");
}


const gnrc_netdev_driver_t cc2538rf_driver = {
    .send_data = _send,
    .add_event_callback = _add_event_cb,
    .rem_event_callback = _rem_event_cb,
    .get = _get,
    .set = _set,
    .isr_event = _isr_event,
};

/*
const netdev2_driver_t cc2538rf_driver_netdev2 = {
    .send = _send,
    .recv = _receive,
    .init = cc2538rf_init,
    .get = _get,
    .set = _set,
    .isr = _isr_event,
};
*/


int cc2538rf_init(cc2538rf_t *dev)
{
  DEBUG("cc2538rf: Init\n");

  //trying to reset whole rf in order not to reset the whole mote
  DEBUG("cc2538rf_init: current RXENABLE: %u \n", (uint8_t)RFCORE->XREG_RXENABLE);


  device = dev;
  dev->driver = &cc2538rf_driver;

  //setting device state to idle
  dev->idle_state = NETOPT_STATE_IDLE;
  //set seq number
  dev->seq_nr = 0;

  //setting clock for the rfcore
  SYS_CTRL->RCGCRFC = 1;
  SYS_CTRL->SCGCRFC = 1;
  SYS_CTRL->DCGCRFC = 1;

  //setting up calibration register (check with Register Settings Update from docu)
  RFCORE->XREG_TXFILTCFG = 0x09; /* TX anti-aliasing filter */
  RFCORE->XREG_AGCCTRL1 = 0x15;  /* AGC target value */
  RFCORE->XREG_FSCAL1 = 0x01;    /* Reduce the VCO leakage */
  ANA_REGS_IVCTRL = 0x0B;        /* Controls bias current */

  //setting cca threshold
  RFCORE->XREG_CCACTRL0 = CC2538RF_CCA_THRES;


  //setting up addresses
  uint64_t longAddress;
  cpuid_get((void*)&longAddress);
  cc2538rf_set_addr_long(dev, longAddress);


#if ENABLE_DEBUG
  uint8_t* longToShortAddress = (uint8_t*) &longAddress;
  DEBUG("cc2538rf: long address from flash: \n");
  for(int i = 0; i<8; i++){
    DEBUG("%x:", longToShortAddress[i]);
  }
  DEBUG("\n");

  DEBUG("cc2538rf: current long address:\n");
  for(int i = 0; i<8; i++){
    DEBUG("%x:", dev->addr_long[i]);
  }
  DEBUG("\n");
#endif

  uint16_t addr_short = (dev->addr_long[6]<<8) | dev->addr_long[7];
  cc2538rf_set_addr_short(dev, addr_short);

  DEBUG("cc2538rf: short address:\n");
  for(int i = 0; i<2; i++){
    DEBUG("%x:", dev->addr_short[i]);
  }
  DEBUG("\n");

  //setting pan id
  DEBUG("cc2538rf: setting pan id: %u\n", CC2538RF_DEFAULT_PANID);
  cc2538rf_set_pan(dev, CC2538RF_DEFAULT_PANID);

  //setting channel
  DEBUG("cc2538rf: setting channel: %u\n", CC2538RF_DEFAULT_CHANNEL);
  cc2538rf_set_chan(dev, CC2538RF_DEFAULT_CHANNEL);

#ifdef MODULE_GNRC_SIXLOWPAN
  DEBUG("cc2538rf: 6lowpan enabled \n");
  dev->proto = GNRC_NETTYPE_SIXLOWPAN;
#else
  dev->proto = GNRC_NETTYPE_UNDEF;
#endif

//set device options to use pan
dev->options |= CC2538RF_OPT_USE_SRC_PAN;
//set device options to use long address
dev->options |= CC2538RF_OPT_SRC_ADDR_LONG;


#ifdef MODULE_GNRC_SIXLOWPAN
    dev->proto = GNRC_NETTYPE_SIXLOWPAN;
#else
    dev->proto = GNRC_NETTYPE_UNDEF;
#endif





  DEBUG("cc2538rf_init: enabling interrupts\n");
  //activating alternate Vector map
  //TODO: doesn`t work, find out why
  SYS_CTRL->I_MAP = 0x1;
  DEBUG("cc2538rf_init: alternate interrupt table flag: %u\n", (uint8_t) SYS_CTRL_I_MAP);
  //enable fifop interrupts
  RFCORE->XREG_RFIRQM0 |= CC2538RF_IRQMASK_FIFOP;
  //enable interrupt when tx is done
  RFCORE->XREG_RFIRQM1 |= CC2538RF_IRQMASK_TXACKDONE;
  RFCORE->XREG_RFIRQM1 |= CC2538RF_IRQMASK_TXDONE;
  //enable rx pkt done
  RFCORE->XREG_RFIRQM0 |= CC2538RF_IRQMASK_RXPKTDONE;


  //enable interrupt in table for TX/RX
  NVIC_EnableIRQ(RF_RXTX_IRQn);

  /* Acknowledge all RF Error interrupts */
  RFCORE->XREG_RFERRM = CC2538RF_RFERRM_RFERRM;
  //enable interrupt in table for TX/RX Error
  NVIC_EnableIRQ(RF_ERR_IRQn);



