RIOT-OS/RIOT/cpu/cc2538/cc2538rf.c
  //setting up AUTOCRC
  RFCORE->XREG_FRMCTRL0 |= RFCORE_XREG_FRMCTRL0_AUTOCRC;

  //disable source matching
  RFCORE->XREG_SRCMATCH = 0;

  //Setup max fifo threshold
  RFCORE->XREG_FIFOPCTRL = CC2538RF_MAX_PACKET_LEN;

  //disable frame filtering
  RFCORE->XREG_FRMFILT0 &= ~0x01;

  //rf_flags |= RF_ON;
  RFCORE->XREG_TXPOWER = CC2538RF_TX_POWER;
  dev->state = NETOPT_STATE_IDLE;

  //put RF into RX mode
  RFCORE_SFR_RFST = CC2538_RF_CSP_OP_ISRXON;

  return 0;
}

void cc2538rf_reset(cc2538rf_t *dev)
{
    //TODO: Reset without losing all the address informations
    cc2538rf_init(dev);
}

bool cc2538rf_cca(cc2538rf_t *dev)
{
  DEBUG("cc2538rf_cca(): reset not implemented yet.\n");
  return false;
}

//Unessecary due to _send function
size_t cc2538rf_send(cc2538rf_t *dev, uint8_t *data, size_t len)
{
  DEBUG("cc2538rf_send(): reset not implemented yet.\n");
  return -1;
}

//Unessecary due to _send function
void cc2538rf_tx_prepare(cc2538rf_t *dev)
{
  DEBUG("cc2538rf_tx_prepare(): reset not implemented yet.\n");
}

size_t cc2538rf_tx_load(uint8_t *data,
                         size_t len, size_t offset)
{
  for(int i = 0+offset; i < len+offset; i++){
      RFCORE_SFR_RFDATA = data[i];
  }
  return 0;
}

void cc2538rf_tx_exec(void)
{
  RFCORE->SFR_RFST = CC2538_RF_CSP_OP_ISTXON;
}

size_t cc2538rf_rx_len(cc2538rf_t *dev)
{
  DEBUG("cc2538rf_rx_len(): reset not implemented yet.\n");
  return 0;
}

void cc2538rf_flush_tx_fifo(void)
{
    RFCORE->SFR_RFST = CC2538_RF_CSP_OP_ISFLUSHTX;
    RFCORE->SFR_RFST = CC2538_RF_CSP_OP_ISFLUSHTX;
}

void cc2538rf_flush_rx_fifo(void)
{
    RFCORE->SFR_RFST = CC2538_RF_CSP_OP_ISFLUSHRX;
    RFCORE->SFR_RFST = CC2538_RF_CSP_OP_ISFLUSHRX;
}

/* TODO: generalize and move to (gnrc_)ieee802154 */
static gnrc_pktsnip_t *_make_netif_hdr(uint8_t *mhr)
{
    uint8_t tmp;
    uint8_t *addr;
    uint8_t src_len, dst_len;
    gnrc_pktsnip_t *snip;
    gnrc_netif_hdr_t *hdr;

    /* figure out address sizes */
    tmp = mhr[1] & IEEE802154_FCF_SRC_ADDR_MASK;
    if (tmp == IEEE802154_FCF_SRC_ADDR_SHORT) {
        src_len = 2;
    }
    else if (tmp == IEEE802154_FCF_SRC_ADDR_LONG) {
        src_len = 8;
    }
    else if (tmp == IEEE802154_FCF_SRC_ADDR_VOID) {
        src_len = 0;
    }
    else {
        return NULL;
    }
    tmp = mhr[1] & IEEE802154_FCF_DST_ADDR_MASK;
    if (tmp == IEEE802154_FCF_DST_ADDR_SHORT) {
        dst_len = 2;
    }
    else if (tmp == IEEE802154_FCF_DST_ADDR_LONG) {
        dst_len = 8;
    }
    else if (tmp == IEEE802154_FCF_DST_ADDR_VOID) {
        dst_len = 0;
    }
    else {
        return NULL;
    }
    /* allocate space for header */
    snip = gnrc_pktbuf_add(NULL, NULL, sizeof(gnrc_netif_hdr_t) + src_len + dst_len,
                           GNRC_NETTYPE_NETIF);
    if (snip == NULL) {
        return NULL;
    }
    /* fill header */
    hdr = (gnrc_netif_hdr_t *)snip->data;
    gnrc_netif_hdr_init(hdr, src_len, dst_len);
    if (dst_len > 0) {
        tmp = 5 + dst_len;
        addr = gnrc_netif_hdr_get_dst_addr(hdr);
        for (int i = 0; i < dst_len; i++) {
            addr[i] = mhr[5 + (dst_len - i) - 1];
        }
    }
    else {
        tmp = 3;
    }
    if (!(mhr[0] & IEEE802154_FCF_PAN_COMP)) {
        tmp += 2;
    }
    if (src_len > 0) {
        addr = gnrc_netif_hdr_get_src_addr(hdr);
        for (int i = 0; i < src_len; i++) {
            addr[i] = mhr[tmp + (src_len - i) - 1];
        }
    }
    return snip;
}

/* TODO: generalize and move to ieee802154 */
/* TODO: include security header implications */
static size_t _get_frame_hdr_len(uint8_t *mhr)
{
    uint8_t tmp;
    size_t len = 3;

    /* figure out address sizes */
    tmp = (mhr[1] & IEEE802154_FCF_DST_ADDR_MASK);
    if (tmp == IEEE802154_FCF_DST_ADDR_SHORT) {
        len += 4;
    }
    else if (tmp == IEEE802154_FCF_DST_ADDR_LONG) {
        len += 10;
    }
    else if (tmp != IEEE802154_FCF_DST_ADDR_VOID) {
        return 0;
    }
    tmp = (mhr[1] & IEEE802154_FCF_SRC_ADDR_MASK);
    if (tmp == IEEE802154_FCF_SRC_ADDR_VOID) {
        return len;
    }
    else {
        if (!(mhr[0] & IEEE802154_FCF_PAN_COMP)) {
            len += 2;
        }
        if (tmp == IEEE802154_FCF_SRC_ADDR_SHORT) {
            return (len + 2);
        }
        else if (tmp == IEEE802154_FCF_SRC_ADDR_LONG) {
            return (len + 8);
        }
    }
    return 0;
}

void cc2538rf_rx_read(void)
{


  if((RFCORE->XREG_RXFIFOCNT) == 0){
    DEBUG("cc2538rf_rx_read: nothing in fifo. Should not happen\n");
    return;
  }

  if(RFCORE->XREG_RXFIRST == 0){
    DEBUG("cc2538rf_rx_read: package length is 0. Frame is invalid. Flushing FIFO\n");
    cc2538rf_flush_rx_fifo();
    return;
  }

  uint8_t mhr[IEEE802154_MAX_HDR_LEN];
  size_t pkt_len, hdr_len;
  gnrc_pktsnip_t *hdr, *payload = NULL;
  gnrc_netif_hdr_t *netif;
  int8_t rssi = 0;
  uint8_t lqi = 0;

  //packet length is the len - 2, as the FCS is attached at the end
  pkt_len = (uint8_t) RFCORE->SFR_RFDATA;

  /* abort here already if no event callback is registered */
  if (!device->event_cb) {
      return;
  }

  /* in raw mode, just read the binary dump into the packet buffer */
  if (device->options & NETOPT_RAWMODE) {
      DEBUG("cc2538rf_rx_read: sending to stack in RAW mode\n");
      payload = gnrc_pktbuf_add(NULL, NULL, pkt_len, GNRC_NETTYPE_UNDEF);
      if (payload == NULL ) {
          DEBUG("cc2538rf_rx_read: unable to allocate RAW data\n");
          return;
      }
      for(int i=0; i<pkt_len; i++){
        *(((uint8_t*)payload->data) + i) = (uint8_t) RFCORE->SFR_RFDATA;
      }
      device->event_cb(NETDEV_EVENT_RX_COMPLETE, payload);
      return;
  }

  /* get FCF field and compute 802.15.4 header length */
  mhr[0]=(uint8_t) RFCORE->SFR_RFDATA;
  mhr[1]=(uint8_t) RFCORE->SFR_RFDATA;
  hdr_len = _get_frame_hdr_len(mhr);
  if (hdr_len == 0) {
      DEBUG("cc2538rf_rx_read: unable parse incoming frame header\n");
      return;
  }



  /* read the rest of the header and parse the netif header from it */
  DEBUG("cc2538rf_rx_read: header with len 0x%x:\n", hdr_len);
  DEBUG("0x%x 0x%x ", mhr[0], mhr[1]);
  for(int i=2; i<hdr_len; i++){
    mhr[i]=(uint8_t) RFCORE->SFR_RFDATA;
    DEBUG("0x%x ", mhr[i]);
  }
  DEBUG("\n");
  hdr = _make_netif_hdr(mhr);
  if (hdr == NULL) {
      DEBUG("cc2538rf_rx_read: unable to allocate netif header\n");
      return;
  }

size_t dataLen = pkt_len - hdr_len - 2;
uint8_t frameData[dataLen];

  DEBUG("cc2538_rx_read: Reading frame data:\n");
  /* copy payload */
  for(int i=0; i<dataLen; i++){
    frameData[i] = (uint8_t) RFCORE->SFR_RFDATA;
    DEBUG("0x%x ", frameData[i]);
  }
  DEBUG("\n");


