RIOT-OS/RIOT/cpu/cc2538/cc2538rf.c
  //get the RSSI and LQI
  rssi = ((uint8_t) RFCORE->SFR_RFDATA) - RSSI_OFFSET;
  lqi = ((uint8_t) RFCORE->SFR_RFDATA)&0x7F;

  /* fill missing fields in netif header */
  netif = (gnrc_netif_hdr_t *)hdr->data;
  netif->if_pid = device->mac_pid;
  DEBUG("cc2538rf_rx_read: device->mac_pid = %i\n", device->mac_pid);
  netif->lqi = lqi;
  netif->rssi = rssi;


  DEBUG("cc2538rf_rx_read: header information:\n");
  DEBUG("src addr len: 0x%x\n", netif->src_l2addr_len);
  DEBUG("dst addr len: 0x%x\n", netif->dst_l2addr_len);

  /* allocate payload */
  DEBUG("cc2538rf_rx_read: device proto is: 0x%x\n", device->proto);
  payload = gnrc_pktbuf_add(hdr, NULL, dataLen, device->proto);
  if (payload == NULL) {
      DEBUG("cc2538rf_rx_read: unable to allocate incoming payload\n");
      gnrc_pktbuf_release(hdr);
      return;
  }

  uint8_t* payloadData = (uint8_t*) payload->data;
  for(int i=0; i<dataLen; i++){
    payloadData[i] = frameData[i];
  }
  /* finish up and send data to upper layers */
  device->event_cb(NETDEV_EVENT_RX_COMPLETE, payload);
}


uint8_t cc2538rf_get_chan(cc2538rf_t *dev)
{
  return dev->chan;
}


void cc2538rf_set_chan(cc2538rf_t *dev, uint8_t chan)
{
  uint8_t regChannel = 11+(5*(chan-11));
  RFCORE_XREG_FREQCTRL = regChannel;
  dev->chan = chan;

}

void cc2538rf_set_addr_long(cc2538rf_t *dev, uint64_t addr)
{
  cc2538_rfcore_t* rfcore = RFCORE;

  uint8_t *addr_cut = (uint8_t*) &addr;
  for(int i = 0; i<8; i++){
    //dev->addr_long[i] = (addr >> ((7-i)*8));
    dev->addr_long[i] = addr_cut[i];
  }

  rfcore->FFSM_EXT_ADDR0 = addr_cut[7];
  rfcore->FFSM_EXT_ADDR1 = addr_cut[6];
  rfcore->FFSM_EXT_ADDR2 = addr_cut[5];
  rfcore->FFSM_EXT_ADDR3 = addr_cut[4];
  rfcore->FFSM_EXT_ADDR4 = addr_cut[3];
  rfcore->FFSM_EXT_ADDR5 = addr_cut[2];
  rfcore->FFSM_EXT_ADDR6 = addr_cut[1];
  rfcore->FFSM_EXT_ADDR7 = addr_cut[0];

}


uint64_t cc2538rf_get_addr_long(cc2538rf_t *dev)
{
  uint64_t longAddr = 0x0;
  for(int i=0; i<8; i++){
    longAddr = (longAddr << 8) | dev->addr_long[i];
  }

  return longAddr;
}


void cc2538rf_set_addr_short(cc2538rf_t *dev, uint16_t addr)
{
    uint8_t *addr_cut = (uint8_t*) &addr;
    dev->addr_short[0] = addr_cut[0];
    dev->addr_short[1] = addr_cut[1];
    cc2538_rfcore_t* rfcore = RFCORE;
    rfcore->FFSM_SHORT_ADDR0 = addr_cut[1];
    rfcore->FFSM_SHORT_ADDR1 = addr_cut[0];
}


uint16_t cc2538rf_get_addr_short(cc2538rf_t *dev)
{
  uint16_t shortAddr = (dev->addr_short[1] << 8) | dev->addr_short[0];
  return shortAddr;
}


void cc2538rf_set_pan(cc2538rf_t *dev, uint16_t pan)
{
    RFCORE_FFSM_PAN_ID0 = (uint8_t) pan;
    RFCORE_FFSM_PAN_ID1 = (uint8_t) pan>>8;
    dev->pan = pan;

}


uint16_t cc2538rf_get_pan(cc2538rf_t *dev)
{
  return dev->pan;
}

//Interrupt Handler for RFCORE Interrupts
void handle_rfcoretxrx_isr(void)
{

  uint8_t irq0 = (uint8_t) RFCORE_SFR_RFIRQF0;
  uint8_t irq1 = (uint8_t) RFCORE_SFR_RFIRQF1;
  uint8_t fsmstat1 = (uint8_t) RFCORE->XREG_FSMSTAT1;
#if ENABLE_DEBUG
  DEBUG("cc2538rf_rfcoreinterrupt: RFIRQF0: 0x%x\n", irq0);
  DEBUG("cc2538rf_rfcoreinterrupt: RFIRQF1: 0x%x\n", irq1);
  DEBUG("cc2538rf_rfcoreinterrupt: FSMSTAT1: 0x%x\n", fsmstat1);
#endif

  //check fifo status
  if(fsmstat1 & 0x40)
  {
    DEBUG("cc2538rf_rfcoreinterrupt: FIFO FSMSTAT1\n");
  }

  //parse for flags
  if(irq1 & CC2538RF_IRQFLAG_TXDONE || irq1 & CC2538RF_IRQFLAG_TXACKDONE)
  {
    DEBUG("cc2538rf_rfcoreinterrupt: TX DONE\n");
    cc2538rf_flush_rx_fifo();
    //RFCORE->SFR_RFIRQF1 &= ~CC2538RF_IRQFLAG_TXDONE;
    //RFCORE->SFR_RFIRQF1 &= ~CC2538RF_IRQFLAG_TXACKDONE;
  }


  if(irq0 & CC2538RF_IRQFLAG_RXPKTDONE || irq0 & CC2538RF_IRQFLAG_FIFOP){
    DEBUG("cc2538rf_rfcoreinterrupt: Reading RX package\n");
#if ENABLE_DEBUG
    uint8_t rxfifocnt = (uint8_t)RFCORE->XREG_RXFIFOCNT;
#endif
    DEBUG("cc2538rf_rfcoreinterrupt: Current RXFIFOCNT: %u\n", rxfifocnt);

    cc2538rf_rx_read();
#if ENABLE_DEBUG
    rxfifocnt = (uint8_t)RFCORE->XREG_RXFIFOCNT;
#endif
    DEBUG("cc2538rf_rfcoreinterrupt: Current RXFIFOCNT after read: %u\n", rxfifocnt);
    /*
    DEBUG("cc2538rf_rfcoreinterrupt: flushing RX fifo\n");
    RFCORE_SFR_RFST = CC2538_RF_CSP_OP_ISFLUSHRX;
    RFCORE_SFR_RFST = CC2538_RF_CSP_OP_ISFLUSHRX;
#if ENABLE_DEBUG
    rxfifocnt = (uint8_t)RFCORE->XREG_RXFIFOCNT;
#endif
    DEBUG("cc2538rf_rfcoreinterrupt: Current RXFIFOCNT after flush: %u\n", rxfifocnt);
    */
    //RFCORE->SFR_RFIRQF0 &= ~CC2538RF_IRQFLAG_RXPKTDONE;
    //RFCORE->SFR_RFIRQF0 &= ~CC2538RF_IRQFLAG_FIFOP;
  }


  if(irq0 & CC2538RF_IRQFLAG_RXMASKZERO)
  {
    DEBUG("cc2538rf_rfcoreinterrupt: RX Disabled\n");
    //RFCORE_SFR_RFST = CC2538_RF_CSP_OP_ISRXON;
#if ENABLE_DEBUG
    uint8_t rxfifocnt = (uint8_t)RFCORE->XREG_RXFIFOCNT;
#endif
    DEBUG("cc2538rf_rfcoreinterrupt: Current RXFIFOCNT: %u\n", rxfifocnt);
    if(!(RFCORE_XREG_FSMSTAT1 & RFCORE_XREG_FSMSTAT1_TX_ACTIVE)){
      RFCORE->SFR_RFST = CC2538_RF_CSP_OP_ISRXON;
    }
    //RFCORE->SFR_RFIRQF1 &= ~CC2538RF_IRQFLAG_RXMASKZERO;
  }
  RFCORE->SFR_RFIRQF1 = 0;
  RFCORE->SFR_RFIRQF0 = 0;

  DEBUG("\n");
}

//Entrypoint for RFCORE Interrupts on Vector 42
void isr_rfcoretx(void)
{
  DEBUG("\n\ncc2538rf: GOT INTERRUPT RFCORE\n");
  handle_rfcoretxrx_isr();
}

//Entrypoint for Alternative RFCORE Interrupts on Vector 157
void isr_rfcoretx_alternate(void)
{
  DEBUG("\n\ncc2538rf: GOT INTERRUPT RFCORE ALTERNATE\n");
  handle_rfcoretxrx_isr();
}


void isr_ssi1(void)
{
  DEBUG("\n\ncc2538rf: GOT INTERRUPT isr_ssil\n");
}


void isr_rfcoreerr(void)
{
  DEBUG("\n\ncc2538rf: GOT INTERRUPT ERROR\n");
  uint8_t rferror = (uint8_t)RFCORE->SFR_RFERRF;
  if(rferror){
    DEBUG("cc2538rf: RF ERROR: 0x%x\n\n", rferror);
    //DEBUG("cc2538rf: Resetting RF\n");

    //Resetting Radio
    //Wait for TX to end
    while(RFCORE->XREG_FSMSTAT1 & RFCORE_XREG_FSMSTAT1_TX_ACTIVE);

    //Flush TX FIFO
    cc2538rf_flush_tx_fifo();

    //Flush RX FIFO
    cc2538rf_flush_rx_fifo();

    //Checking if Radio is already off, otherwise we get a Strobe Error
    if(RFCORE_XREG_RXENABLE != 0) {
      RFCORE_SFR_RFST = CC2538_RF_CSP_OP_ISRFOFF;
    }

    RFCORE->SFR_RFERRF = (uint8_t) 0x0;
    RFCORE_SFR_RFST = CC2538_RF_CSP_OP_ISRXON;

    //cc2538rf_init(device);
  }

}
